"""
config.py - Конфигурация сервера
"""
import sqlite3


class Config: # Базовая конфигурация
    # Настройки базы данных
    DATABASE = 'plantcare.db'
    # Настройки безопасности
    ESP32_API_KEY = "esp32_secret_key_123"
    TOKEN_EXPIRATION_HOURS = 1
    # Настройки сервера
    HOST = '0.0.0.0'
    PORT = 5000
    DEBUG = True

    # Функция для создания базовых сценариев
    def make_base_scenarios(self, DATABASE):
        conn = sqlite3.connect(DATABASE)
        cursor = conn.cursor()
        # ИЗМЕНЕНИЕ: Проверяем только публичные сценарии
        # Проверяем только публичные сценарии
        cursor.execute("SELECT COUNT(*) FROM scenarios WHERE created_by IS NULL")
        if cursor.fetchone()[0] == 0:  # ← если публичных сценариев = 0
            default_scenarios = [
                ("Тропики", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Зелёный оазис", 18.0, 24.0, 60.0, 95.0, 60.0, 90.0, 3000.0, 3900.0, None),
                ("Экзотический сад", 24.0, 30.0, 85.0, 100.0, 70.0, 95.0, 3000.0, 3900.0, None),
                ("Моховой уголок", 10.0, 18.0, 60.0, 90.0, 40.0, 60.0, 4000.0, 6000.0, None),
                ("Комнатный уют", 18.0, 24.0, 60.0, 80.0, 40.0, 60.0, 2300.0, 2700.0, None),
                ("Тёплый тропик", 24.0, 30.0, 60.0, 85.0, 40.0, 60.0, 3000.0, 7000.0, None),
                ("Лесная тень", 24.0, 30.0, 30.0, 60.0, 60.0, 90.0, 4000.0, 6000.0, None),
                ("Светлый уголок", 18.0, 24.0, 30.0, 60.0, 40.0, 60.0, 2600.0, 4000.0, None),
                ("Солнечный сад", 24.0, 30.0, 60.0, 85.0, 40.0, 60.0, 7000.0, 15000.0, None),
                ("Холодный уют", 10.0, 18.0, 0.0, 30.0, 60.0, 90.0, 2600.0, 4000.0, None),
                ("Умеренный климат", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Сухая пустыня", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Моховой лес", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Сухой оазис", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Пустынный цветок", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Холодная пустыня", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Сухая равнина", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None),
                ("Жаркая пустыня", 10.0, 18.0, 60.0, 95.0, 60.0, 90.0, 2300.0, 2700.0, None)
            ]

            cursor.executemany(
                """INSERT INTO scenarios 
                   (nam, min_temperature, max_temperature, 
                    min_soil_moisture, max_soil_moisture,
                    min_humidity, max_humidity,
                    min_light_lux, max_light_lux, created_by) 
                   VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)""",
                default_scenarios
            )

            print(f"Создано {len(default_scenarios)} базовых сценариев")
        else:
            print("Базовые сценарии уже существуют")

        conn.commit()
        conn.close()

class DevelopmentConfig(Config): # Конфигурация для разработки
    DEBUG = True


class ProductionConfig(Config): # Конфигурация для продакшена
    DEBUG = False
    ESP32_API_KEY = "ваш_настоящий_секретный_ключ"